app/controllers/pages_controller.rb

SELECT * FROM "assistants" WHERE ("assistants"."name" = 'Rafa Santos') LIMIT 1
INSERT INTO "assistants" ("name", "created_at", "devhouse", "project_description", "nickname", "updated_at", "facebook", "project_name", "twitter") VALUES('pruebapruebaprueba', '2009-06-27 17:32:41', 8, 'Es lo mas cool desde los conejos de chocolate', 'tucif', '2009-06-27 17:32:41', 'pruebapruebaprueba', 'Super Proyecto', 'tucif')
---
  def register
    if request.post?
      twitter   = (params[:twitter_same_as_nickname]  == '1' and params[:nickname])  || params[:twitter]
      twitter.gsub! /^@/, ''
      facebook  = (params[:facebook_same_as_name]     == '1' and params[:name])      ||
                  (params[:facebook_same_as_nickname] == '1' and params[:nickname])  ||
                   params[:facebook]
      facebook = facebook.gsub(/[^A-Za-z]/, '').downcase if facebook
      valid_params = [:name, :nickname, :project_name, :project_description].inject({}) do |hash, param|
        hash[param] = params[param]
        hash
      end
      if Assistant.find_by_name(params[:name])
        render :update do |page|
          page.replace_html '#notice', 'Seems like you were already registered. Keep it up, dude!'
          page << "$.fn.fancybox.close();"
        end
        return
      end
      @assistant = Assistant.new(valid_params.merge(
                :devhouse => SHDH_SETTINGS[:number],
                :twitter => twitter,
                :facebook => facebook
              ))
      if @assistant.save